{
  "heavy": {
    "navbar": {
      "navbarLinks": [
        {
          "URL": "/",
          "text": "HOME"
        },
        {
          "URL": "/menu",
          "text": "MENU"
        },
        {
          "URL": "/learn/editors/light",
          "text": "LIGHT"
        },
        {
          "URL": "#features-section",
          "text": "FEATURES"
        }
      ],
      "menuLinks": [
        {
          "name": "Visual Studio",
          "image": "/editors/heavy/visual.png"
        },
        {
          "name": "Apple XCode",
          "image": "/editors/heavy/xcode.png"
        },
        {
          "name": "JetBrains",
          "image": "/editors/heavy/jetbrains.png"
        },
        {
          "name": "Android Studio",
          "image": "/editors/heavy/android.png"
        },
        {
          "name": "Eclipse",
          "image": "/editors/heavy/eclipse.png"
        },
        {
          "name": "Zend Studio",
          "image": "/editors/heavy/zend.png"
        },
        {
          "name": "Apache NetBeans",
          "image": "/editors/heavy/netbeans.png"
        }
      ]
    },
    "introduction": {
      "title": "WHAT IS AN IDE?",
      "image": "/editors/intro/heavy.png",
      "description": "Integrated Development Environment is a professional platform for developers to write code. An IDE is made up of multiple state of the art components which are fully integrated in the software. These components help the developer to write code efficiently, provide deep performance analysis, help in debugging your code to find errors and solutions, and do much more.",
      "URL": "https://en.wikipedia.org/wiki/Integrated_development_environment"
    },
    "others": {
      "editorsTitle": "Heavy",
      "collectionTitle": "ENTERPRISE LEVEL EDITORS",
      "featuresTitle": "WHAT MAKES AN IDE SPECIAL?"
    },
    "collection": [
      {
        "name": "Visual Studio",
        "image": "/editors/heavy/visual.png",
        "description": "Visual Studio is an IDE created by Microsoft. It is fully integrated with the .Net Core and is used to build various cross-platform applications. It has exclusive support for .Net languages like C#, F#, Q#, R, TypeScript and Visual Basic. The .Net Framework and .Net Core are two frameworks created by Microsoft to build various native and cross-platform applications. Visual Studio integrates these standard languages as well as all libraries related to the .Net Ecosystem.",
        "primaryURL": "https://visualstudio.microsoft.com/",
        "secondaryURL": "/learn/coding/frameworks#BACK-END",
        "secondaryURLText": ".Net Core"
      },
      {
        "name": "Apple XCode",
        "image": "/editors/heavy/xcode.png",
        "description": "Apple XCode is an IDE and rendering environment, developed by Apple, to build iOS and MacOS applications. It is fully integrated with the Swift & Objective-C programming languages. It has rich UI, audio, graphics and other rendering libraries. With Swift, one can develop iOS apps for the iPhone and Apple Watch. With Objective-C, one can make MacOS applications.",
        "primaryURL": "https://developer.apple.com/xcode/",
        "secondaryURL": "/learn/coding/frameworks#MOBILE-DEV",
        "secondaryURLText": "Languages"
      },
      {
        "name": "JetBrains",
        "image": "/editors/heavy/jetbrains.png",
        "description": "JetBrains is a software company that provides tools and editors for software developers. The company is best known for its IDEs such as IntelliJ IDEA, Rider, PhpStorm, PyCharm, RubyMine, WebStorm, AppCode, DataSpell and many more. Each IDE is designed for the development of a specific application. Enriched with JetBrains' exclusive features and standard components, these IDEs provide an alternate path to create some of the best products in the industry.",
        "primaryURL": "https://www.jetbrains.com/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Android Studio",
        "image": "/editors/heavy/android.png",
        "description": "Android Studio is the official IDE for Android App Development, developed by Google. It provides a comprehensive set of tools for building, testing, and debugging Android applications. It includes emulators, drag and drop components, debugging engine, code analyzer and support for various programming languages, including Java and Kotlin. It is also used for other frameworks and libraries, like Flutter for Android and iOS development.",
        "primaryURL": "https://developer.android.com/studio",
        "secondaryURL": "/learn/coding/frameworks#MOBILE-DEV",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Eclipse",
        "image": "/editors/heavy/eclipse.png",
        "description": "Eclipse is a free and open-source integrated development environment (IDE) that is widely used by developers around the world. Eclipse provides a rich set of features and tools for developing applications in various programming languages, including Java, C++, Python, and more. Eclipse also provides a powerful editor with syntax highlighting, code completion, and debugging capabilities, as well as advanced tools for profiling, testing, and version control.",
        "primaryURL": "https://www.eclipse.org/",
        "secondaryURL": "/learn/coding/languages#Java",
        "secondaryURLText": "Languages"
      },
      {
        "name": "Zend Studio",
        "image": "/editors/heavy/zend.png",
        "description": "Zend Studio has built-in support for PHP and popular PHP frameworks such as Laravel, Symphony, and Zend Framework, making it easy for developers to create applications using these frameworks. It also provides support for cloud-based development and deployment, with built-in support for cloud platforms such as Amazon Web Services, Microsoft Azure, and Google Cloud Platform.",
        "primaryURL": "https://www.zend.com/downloads/zend-studio",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Apache NetBeans",
        "image": "/editors/heavy/netbeans.png",
        "description": "NetBeans is a free and open-source IDE that provides a wide range of tools and features for building, testing, and deploying desktop, web, and mobile applications using various programming languages such as Java, PHP, JavaScript, HTML5, and C++. It also provides a powerful editor with syntax highlighting, code completion, and debugging capabilities, as well as advanced tools for profiling, testing, and version control.",
        "primaryURL": "https://netbeans.apache.org/",
        "secondaryURL": "/learn/coding/languages#Java",
        "secondaryURLText": "Languages"
      }
    ],
    "features": [
      [
        {
          "image": "/editors/features/project.png",
          "title": "PROJECT MANAGEMENT",
          "description": "An IDE is integrated with tools that help developers manage their codebase and dependencies. The IDE can rebuild the solution and resolve any issues."
        },
        {
          "image": "/editors/features/frame.png",
          "title": "FRAMEWORKS & LIBRARIES",
          "description": "An IDE can integrate cross-platform or native frameworks and libraries that help developers build modern, professional and enterprise-level applications."
        },
        {
          "image": "/editors/features/speed.png",
          "title": "EFFICIENT & OPTIMIZED",
          "description": "An IDE can load libraries, packages and other dependencies with great ease and efficiency. The memory and storage details can be monitored at every frame."
        }
      ],
      [
        {
          "image": "/editors/features/deploy.png",
          "title": "DEPLOYMENT TOOLS",
          "description": "An IDE makes deployment to various platforms, quick and easy. With the deployment tools, you can easily create the required executable for that platform."
        },
        {
          "image": "/editors/features/error.png",
          "title": "DEBUGGING ENGINE",
          "description": "Every IDE is known for its robust debugging engine. With the debugger, you can find all the errors in your code and track every frame using the breakpoint system."
        },
        {
          "image": "/editors/features/intel.png",
          "title": "CODE INTELLISENSE",
          "description": "Code intellisense helps developers write code much faster and efficiently. One can analyze the performance issues and get suggestions for better code."
        }
      ],
      [
        {
          "image": "/editors/features/version.png",
          "title": "VERSION CONTROL",
          "description": "Popular version control systems like GitHub are fully integrated into famous IDEs like Visual Studio. Creating and managing versions is made easier with an IDE."
        },
        {
          "image": "/editors/features/data.png",
          "title": "SERVERS & DATA",
          "description": "An IDE can also be used to quickly deploy web servers and cloud containers like Docker. Managing code and data on the server is also made easy by the IDE."
        },
        {
          "image": "/editors/features/graph.png",
          "title": "GRAPH VISUALIZATION",
          "description": "Some IDEs are integrated with a graph visualizer, thus making it easier to analyze and edit graphs. Some also have a GUI editing interface for low-code developers."
        }
      ]
    ]
  },
  "light": {
    "navbar": {
      "navbarLinks": [
        {
          "URL": "/",
          "text": "HOME"
        },
        {
          "URL": "/menu",
          "text": "MENU"
        },
        {
          "URL": "/learn/editors/heavy",
          "text": "HEAVY"
        },
        {
          "URL": "#features-section",
          "text": "FEATURES"
        }
      ],
      "menuLinks": [
        {
          "name": "Visual Studio Code",
          "image": "/editors/light/vscode.png"
        },
        {
          "name": "Atom Electron",
          "image": "/editors/light/atom.png"
        },
        {
          "name": "Brackets",
          "image": "/editors/light/brackets.png"
        },
        {
          "name": "Sublime Text",
          "image": "/editors/light/sublime.png"
        },
        {
          "name": "Notepad++",
          "image": "/editors/light/notepad.png"
        },
        {
          "name": "Vim",
          "image": "/editors/light/vim.png"
        },
        {
          "name": "GNU Emacs",
          "image": "/editors/light/gnu.png"
        },
        {
          "name": "TextMate",
          "image": "/editors/light/text.png"
        }
      ]
    },
    "introduction": {
      "title": "LIGHT & EFFICIENT",
      "image": "/editors/intro/heavy.png",
      "description": "A light-weight code editor is an open source platform for developers to write, debug and run code easily. They are faster, more efficient and highly optimized as compared to a professional IDE. These editors are based on the loading and unloading of tools called plugins or extensions. They are equipped with fully customizable code analyzers, intellisense, debuggers and much more.",
      "URL": "https://en.wikipedia.org/wiki/Integrated_development_environment",
      "collectionTitle": "FAST, EFFICIENT & POWERFUL",
      "featuresTitle": "WHAT MAKES AN IDE SPECIAL?"
    },
    "others": {
      "editorsTitle": "Light",
      "collectionTitle": "FAST, EFFICIENT & POWERFUL",
      "featuresTitle": "WHAT MAKES AN IDE SPECIAL?"
    },
    "collection": [
      {
        "name": "Visual Studio Code",
        "image": "/editors/light/vscode.png",
        "description": "Visual Studio Code is a light-weight code editor developed by Microsoft. It is fast, efficient and highly optimized. It is equipped with a code analyzer, intellisense, debugger and a tester, but all of these can be customized to fit the working of any framework, library or language. It does not provide native support for any major framework but can be used to develop all kinds of professional applications. Plugins, best called extensions, provide the major functionality of the overall code editor.",
        "primaryURL": "https://code.visualstudio.com/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Atom Electron",
        "image": "/editors/light/atom.png",
        "description": "Atom Electron, commonly referred to as Electron, is a free and open-source editor used to build desktop applications using web technologies such as HTML, CSS, and JavaScript. It was developed and is maintained by GitHub, and is used by various popular applications such as Microsoft Visual Studio Code, Slack, and Discord. Electron provides developers with a platform to create cross-platform desktop applications. It is highly customizable, and provides a range of built-in features, such as automatic updates and crash reporting.",
        "primaryURL": "https://www.electronjs.org/",
        "secondaryURL": "/learn/coding/frameworks#FRONT-END",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Brackets",
        "image": "/editors/light/brackets.png",
        "description": "Brackets is an open source code editor developed with JavaScript. It is a famous light-weight platform dedicated for front-end technologies like HTML, CSS, JavaScript and TypeScript. It has many plugins like Git, Emmet, Beautify and much more, to provide a great coding experience. It also provides support for popular back-end technologies like Node Js. It is fast, efficient and enriched with many open-source plugins. A great option for professional web development projects.",
        "primaryURL": "https://brackets.io/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Sublime Text",
        "image": "/editors/light/sublime.png",
        "description": "Sublime Text is a popular text editor designed for programmers and developers. It provides a range of advanced features and tools for working with text and code, including syntax highlighting, code folding, and auto-completion. Sublime Text is known for its speed and efficiency, as well as its ability to handle large files and projects with ease. It provides a powerful search and replace feature that enables developers to perform complex text operations quickly and easily.",
        "primaryURL": "https://www.sublimetext.com/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Notepad++",
        "image": "/editors/light/notepad.png",
        "description": "Notepad++ is a free and open source code editor, that supports several languages. It operates in the MS Windows Environment, and GNU, General Public License, controls how to utilize it. Notepad++ is a sophisticated editing programme that is based on Scintilla. It is designed in C++ and leverages pure Win32 API and STL to guarantee faster programme execution and a reduced programme size. It is used for C/C++ and Assembly code. It is very famous for its great performance.",
        "primaryURL": "https://notepad-plus-plus.org/downloads/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "Vim",
        "image": "/editors/light/vim.png",
        "description": "Vim provides a range of advanced features and tools for working with text and code, including syntax highlighting, code folding, and auto-completion. It also includes powerful editing capabilities, such as multi-level undo/redo, macros, and support for regular expressions. It highly customizable and provides a range of plugins and extensions that enable developers to extend its functionality and add new features. It also supports various programming languages, including C++, Python, Ruby, and more. It is available for various operating systems, including Linux, macOS, and Windows.",
        "primaryURL": "https://www.vim.org/download.php",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "GNU Emacs",
        "image": "/editors/light/gnu.png",
        "description": "GNU Emacs is a free and open-source text editor that is designed for programmers and developers. It is maintained by the GNU Project and provides a wide range of features and tools for working with text and code. Emacs supports a wide range of programming languages and provides features such as syntax highlighting, code folding, and auto-completion. It also includes built-in support for version control systems such as Git and Subversion. Emacs also provides a powerful macro system that enables developers to automate repetitive tasks and workflows.",
        "primaryURL": "https://www.gnu.org/software/emacs/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      },
      {
        "name": "TextMate",
        "image": "/editors/light/text.png",
        "description": "TextMate is a text editor for macOS that is designed for programmers and developers. It provides a wide range of features and tools for working with code and text, including syntax highlighting, code folding, code snippets, and more. One of the key features of TextMate is its ability to support a wide range of programming languages, including Objective-C, Python, Ruby, and HTML. It also provides built-in support for popular web development frameworks such as Ruby on Rails and Django.",
        "primaryURL": "https://macromates.com/",
        "secondaryURL": "/learn/coding/frameworks",
        "secondaryURLText": "Frameworks"
      }
    ],
    "features": [
      [
        {
          "image": "/editors/features/project.png",
          "title": "PROJECT MANAGEMENT",
          "description": "An IDE is integrated with tools that help developers manage their codebase and dependencies. The IDE can rebuild the solution and resolve any issues."
        },
        {
          "image": "/editors/features/frame.png",
          "title": "FRAMEWORKS & LIBRARIES",
          "description": "An IDE can integrate cross-platform or native frameworks and libraries that help developers build modern, professional and enterprise-level applications."
        },
        {
          "image": "/editors/features/speed.png",
          "title": "EFFICIENT & OPTIMIZED",
          "description": "An IDE can load libraries, packages and other dependencies with great ease and efficiency. The memory and storage details can be monitored at every frame."
        }
      ],
      [
        {
          "image": "/editors/features/deploy.png",
          "title": "DEPLOYMENT TOOLS",
          "description": "An IDE makes deployment to various platforms, quick and easy. With the deployment tools, you can easily create the required executable for that platform."
        },
        {
          "image": "/editors/features/error.png",
          "title": "DEBUGGING ENGINE",
          "description": "Every IDE is known for its robust debugging engine. With the debugger, you can find all the errors in your code and track every frame using the breakpoint system."
        },
        {
          "image": "/editors/features/intel.png",
          "title": "CODE INTELLISENSE",
          "description": "Code intellisense helps developers write code much faster and efficiently. One can analyze the performance issues and get suggestions for better code."
        }
      ],
      [
        {
          "image": "/editors/features/version.png",
          "title": "VERSION CONTROL",
          "description": "Popular version control systems like GitHub are fully integrated into famous IDEs like Visual Studio. Creating and managing versions is made easier with an IDE."
        },
        {
          "image": "/editors/features/data.png",
          "title": "SERVERS & DATA",
          "description": "An IDE can also be used to quickly deploy web servers and cloud containers like Docker. Managing code and data on the server is also made easy by the IDE."
        },
        {
          "image": "/editors/features/graph.png",
          "title": "GRAPH VISUALIZATION",
          "description": "Some IDEs are integrated with a graph visualizer, thus making it easier to analyze and edit graphs. Some also have a GUI editing interface for low-code developers."
        }
      ]
    ]
  }
}
