{
  "types": [
    {
      "title": "HEAVY WEIGHT CODE EDITORS",
      "description": "A heavy weight code editor is better know as an I.D.E. These editors are professional platforms used to build enterprise level applications. They are equipped with multiple features for efficiency, optimization and an overall better coding experience. Most editors also support major frameworks and libraries.",
      "image": "/menu/heavy.jpg",
      "primaryURL": "/learn/editors/heavy",
      "primaryText": "Explore IDEs",
      "secondaryURL": "",
      "secondaryText": "Source"
    },
    {
      "title": "LIGHT WEIGHT CODE EDITORS",
      "description": "A light weight code editor is a lighter variant of a professional I.D.E. They focus on performance and optimization. There are many components and features, called plugins or extensions, that can be installed and uninstalled anytime. They are mainly designed for developers who want a more personal and customizable environment. They are used for smaller professional applications.",
      "image": "/menu/light.jpg",
      "primaryURL": "/learn/editors/light",
      "primaryText": "Explore Editors",
      "secondaryURL": "",
      "secondaryText": "Source"
    },
    {
      "title": "FRAMEWORKS & LIBRARIES",
      "description": "Frameworks are a collection of libraries, packages and scripts used by developers to build various cross-platform, professional and enterprise level applications. These libraries help in building complex features easily and help in writing efficient code. Popular I.D.E.s integrate many frameworks and their libraries.",
      "image": "/menu/frame.jpg",
      "primaryURL": "/learn/coding/frameworks",
      "primaryText": "Frameworks",
      "secondaryURL": "",
      "secondaryText": "Source"
    },
    {
      "title": "CODING LANGUAGES",
      "description": "Coding languages of various architectures and paradigms are used to build professional and enterprise level applications. Understanding the language and its core functionality within popular frameworks and libraries is very important when writing code. Many famous tools are built entirely from a single language and this tool is then used to build applications.",
      "image": "/menu/code.jpg",
      "primaryURL": "/learn/coding/languages",
      "primaryText": "Languages",
      "secondaryURL": "",
      "secondaryText": "Source"
    }
  ]
}
